phuquoc3319/STM32-LCD-I2C-HAL/Src/main.c
#include "main.h"
#include "stm32f4xx_hal.h"
#include "i2c.h"
#include "gpio.h"
#include "i2c-lcd.h"

void SystemClock_Config(void);



int main(void)
{
 
  HAL_Init();

 
  SystemClock_Config();

 
  MX_GPIO_Init();
  MX_I2C1_Init();
	lcd_init();
 
  while (1)
  {
		lcd_send_cmd (0x80); // go to 1,0
		lcd_print_string ("Quoc Ngo");
		HAL_Delay (2000);
		lcd_send_cmd (0x01); // clear display
		HAL_Delay (100);
		lcd_send_cmd(0xC0);
		lcd_print_string("Tracey Ngo");
		HAL_Delay(2000);
		lcd_send_cmd(0x01);
		HAL_Delay(100);
//		lcd_send_cmd (0xC0); // go to 2 0
//		lcd_print_string ("Ha Thu Phuong");
//		HAL_Delay (3000);
//		lcd_send_cmd (0x01);
//		HAL_Delay (100);
//		lcd_send_cmd (0x94); // go to 3 0
//		lcd_print_string ("STM32 LCD LIBRARY");
//		HAL_Delay (1000);
//		lcd_send_cmd (0x01);
//		HAL_Delay (100);
//		lcd_send_cmd (0xD4); // go to 4 0
//		lcd_print_string ("TEST COMPLETE");
//		HAL_Delay (2000);
//		lcd_send_cmd (0x01);
//		HAL_Delay (100);
  }
  

}


void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}


void _Error_Handler(char *file, int line)
{

  while(1)
  {
  }
  
}

#ifdef  USE_FULL_ASSERT

void assert_failed(uint8_t* file, uint32_t line)
{ 
 
}
#endif /* USE_FULL_ASSERT */

